esp32-open-mac/qemu/hw/timer/esp32c3_timg.c
    }
}


static void esp32c3_t0_counter_load(ESP32C3T0State* t)
{
    /* Update the counter so that the (time) base is up to date */
    esp32c3_t0_update_counter(t);

    /* Set the new counter */
    t->value_rel = t->value_toload;

    /* Reprogram the alarm if necessary */
    esp32c3_t0_alarm_update(t);
}

static void esp32c3_t0_config_update(ESP32C3T0State* t0, uint32_t value)
{
    const uint32_t former_conf = t0->config;
    /* Assign the new configuration while removing the write-only bits */
    t0->config = value & ~(R_TIMG_T0CONFIG_DIVCNT_RST_MASK);

    /* If the counter was enabled until now, update its value */
    if (former_conf & R_TIMG_T0CONFIG_EN_MASK) {
        esp32c3_t0_update_counter(t0);
    }

    /* Calculate the new frequency */
    const uint32_t new_divider = FIELD_EX32(value, TIMG_T0CONFIG, DIVIDER);
    const uint64_t new_clk = FIELD_EX32(value, TIMG_T0CONFIG, USE_XTAL) ? ESP32C3_XTAL_CLK : ESP32C3_APB_CLK;
    const uint64_t new_freq = new_clk / new_divider;
    if (new_freq != t0->counter.frequency) {
        t0->counter.frequency = new_freq;
    }

    if (value & R_TIMG_T0CONFIG_DIVCNT_RST_MASK) {
        esp32c3_virtual_counter_reset(&t0->counter);
        esp32c3_t0_alarm_update(t0);
    }

    /* If the alarm state just changed, we have to load it or disable it */
    if (FIELD_CHANGED(former_conf, value, TIMG_T0CONFIG, ALARM_EN)) {
        if (value & R_TIMG_T0CONFIG_ALARM_EN_MASK) {
            esp32c3_t0_alarm_update(t0);
        } else {
            timer_del(&t0->counter.timer);
        }
    }

    /* If the direction of the counter changed, reprogram the alarm. The function esp32c3_t0_alarm_update
     * will check if the counter and alarm are enabled first, no need to do it here. */
    if (FIELD_CHANGED(former_conf, value, TIMG_T0CONFIG, INCREASE)) {
        esp32c3_t0_alarm_update(t0);
    }

    /* Finally, check if the counter state changed */
    if (FIELD_CHANGED(former_conf, value, TIMG_T0CONFIG, EN)) {
        if (value & R_TIMG_T0CONFIG_EN_MASK) {
            /* the counter was disabled, it has just been re-enabled, its value should not be updated,
             * but the base time should be updated to now. */
            esp32c3_virtual_counter_reenabled(&t0->counter);
            esp32c3_t0_alarm_update(t0);
        } else {
            /* In theory, we should update the counter before disabling its timer, but in practice, we
             * already did that at the beginning of this function. Thus, the base time is correct. */
            timer_del(&t0->counter.timer);
        }
    }
}


/**
 * Functions related to the hardware registers
 */
static uint64_t esp32c3_timg_read(void *opaque, hwaddr addr, unsigned int size)
{
    ESP32C3TimgState *s = ESP32C3_TIMG(opaque);

    uint64_t r = 0;
    switch (addr) {
        case A_TIMG_RTCCALICFG:
            r = s->rtc.rtc_cali_cfg;
            break;
        case A_TIMG_RTCCALICFG1:
            r = s->rtc.rtc_cali_cfg_result;
            break;
        case A_TIMG_RTCCALICFG2:
            r = s->rtc.rtc_cali_cfg_timeout;
            break;


        /* Timer (T0) related registers */
        case A_TIMG_T0CONFIG:
            r = s->t0.config;
            break;
        case A_TIMG_T0LO:
            r = s->t0.value_flushed & UINT32_MAX;
            break;
        case A_TIMG_T0HI:
            r = s->t0.value_flushed >> 32;
            break;
        case A_TIMG_T0UPDATE:
            /* Write-only register */
            break;
        case A_TIMG_T0ALARMLO:
            r = s->t0.alarm & UINT32_MAX;
            break;
        case A_TIMG_T0ALARMHI:
            r = s->t0.alarm >> 32;
            break;
        case A_TIMG_T0LOADLO:
            r = s->t0.value_toload & UINT32_MAX;
            break;
        case A_TIMG_T0LOADHI:
            r = s->t0.value_toload >> 32;
            break;
        case A_TIMG_T0LOAD:
            /* Write-only register */
            break;


        /* Watchdog related registers */
        case A_TIMG_WDTCONFIG0:
            r = s->wdt.config0;
            break;
        case A_TIMG_WDTCONFIG1:
            r = s->wdt.prescaler_mirror & ~R_TIMG_WDTCONFIG1_DIVCNT_RST_MASK;
            break;
        case A_TIMG_WDTCONFIG2:
        case A_TIMG_WDTCONFIG3:
        case A_TIMG_WDTCONFIG4:
        case A_TIMG_WDTCONFIG5:
            r = s->wdt.stage_mirror[(addr - A_TIMG_WDTCONFIG2) / sizeof(uint32_t)];
            break;
        case A_TIMG_WDTFEED:
            /* This register is read-only, but avoid a warning */
            break;
        case A_TIMG_WDTWPROTECT:
            r = s->wdt.wkey;
            break;

        case A_TIMG_INT_ENA_TIMG:
            r |= s->wdt.int_enabled << R_TIMG_INT_ENA_TIMG_WDT_ENA_SHIFT;
            r |= s->t0.int_enabled << R_TIMG_INT_ENA_TIMG_T0_ENA_SHIFT;
            break;
        case A_TIMG_INT_RAW_TIMG:
            r |= s->wdt.raw_st << R_TIMG_INT_RAW_TIMG_WDT_RAW_SHIFT;
            r |= s->t0.raw_st << R_TIMG_INT_RAW_TIMG_T0_RAW_SHIFT;
            break;
        case A_TIMG_INT_ST_TIMG:
            r |= (s->wdt.int_enabled && s->wdt.raw_st) << R_TIMG_INT_ST_TIMG_WDT_ST_SHIFT;
            r |= (s->t0.int_enabled && s->t0.raw_st) << R_TIMG_INT_ST_TIMG_T0_ST_SHIFT;
            break;

        default:
#if TIMG_WARNING
            warn_report("[TIMG] Unsupported read from %08lx\n", addr);
#endif
            break;
    }

#if TIMG_DEBUG
    info_report("[TIMG] Reading from %08lx (%08lx)\n", addr, r);
#endif
    return r;
}

static void esp32c3_timg_write(void *opaque, hwaddr addr,
                       uint64_t value, unsigned int size)
{
    ESP32C3TimgState *s = ESP32C3_TIMG(opaque);

    switch(addr) {
        case A_TIMG_RTCCALICFG:
            esp32c3_timg_rtc_cali_update(s, value);
            break;
        case A_TIMG_RTCCALICFG2:
            esp32c3_timg_rtc_cali_check_timeout(s, value);
            break;

        /* Timer (T0) related registers */
        case A_TIMG_T0CONFIG:
            esp32c3_t0_config_update(&s->t0, value);
            break;
        case A_TIMG_T0LO:
        case A_TIMG_T0HI:
            /* These registers are read-only but implement them to avoid getting a warning */
            break;
        case A_TIMG_T0UPDATE:
            esp32c3_t0_counter_flush(&s->t0);
            break;
        case A_TIMG_T0ALARMLO:
            s->t0.alarm = load_low(s->t0.alarm, value);
            esp32c3_t0_alarm_update(&s->t0);
            break;
        case A_TIMG_T0ALARMHI:
            s->t0.alarm = load_high(s->t0.alarm, value);
            esp32c3_t0_alarm_update(&s->t0);
            break;
        case A_TIMG_T0LOADLO:
            s->t0.value_toload = load_low(s->t0.value_toload, value);
            break;
        case A_TIMG_T0LOADHI:
            s->t0.value_toload = load_high(s->t0.value_toload, value);
            break;
        case A_TIMG_T0LOAD:
            esp32c3_t0_counter_load(&s->t0);
            break;


        /* Watchdog related registers */
        case A_TIMG_WDTCONFIG0:
            esp32c3_wdt_update_config(&s->wdt, value);
            break;
        case A_TIMG_WDTCONFIG1:
            s->wdt.prescaler_mirror = value;
            break;
        case A_TIMG_WDTCONFIG2:
        case A_TIMG_WDTCONFIG3:
        case A_TIMG_WDTCONFIG4:
        case A_TIMG_WDTCONFIG5:
            s->wdt.stage_mirror[(addr - A_TIMG_WDTCONFIG2) / sizeof(uint32_t)] = value;
            break;
        case A_TIMG_WDTFEED:
            esp32c3_wdt_feed(&s->wdt);
            break;
        case A_TIMG_WDTWPROTECT:
            s->wdt.wkey = value;
            break;

        /* Interrupt related registers */
        case A_TIMG_INT_ENA_TIMG:
            s->wdt.int_enabled = FIELD_EX32(value, TIMG_INT_ENA_TIMG, WDT_ENA) ? true : false;
            s->t0.int_enabled = FIELD_EX32(value, TIMG_INT_ENA_TIMG, T0_ENA) ? true : false;
            break;
        case A_TIMG_INT_CLR_TIMG:
            if (FIELD_EX32(value, TIMG_INT_CLR_TIMG, WDT_CLR)) {
                s->wdt.raw_st = 0;
                qemu_irq_lower(s->wdt.interrupt_irq);
            }
            if (FIELD_EX32(value, TIMG_INT_CLR_TIMG, T0_CLR)) {
                s->t0.raw_st = 0;
                qemu_irq_lower(s->t0.interrupt_irq);
            }
            break;
        case A_TIMG_INT_RAW_TIMG:
        case A_TIMG_INT_ST_TIMG:
            break;

        default:
#if TIMG_WARNING
            warn_report("[TIMG] Unsupported write to %08lx (%08lx)\n", addr, value);
#endif
            break;
    }

