esp32-open-mac/qemu/hw/timer/esp32c3_timg.c
#if TIMG_DEBUG
    info_report("[TIMG] Writing to %08lx = %08lx\n", addr, value);
#endif
}


static const MemoryRegionOps esp32c3_timg_ops = {
    .read =  esp32c3_timg_read,
    .write = esp32c3_timg_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
};


static void esp32c3_timg_reset(DeviceState* ts)
{
    ESP32C3TimgState *s = ESP32C3_TIMG(ts);

    /* Reset watchdog */
    esp32c3_virtual_counter_reset(&s->wdt.counter);
    s->wdt.config0 = 0;
    s->wdt.wkey = ESP32C3_WDT_DEFAULT_WKEY;
    s->wdt.current_stage = 0;
    memset(&s->wdt.stage_conf, 0, sizeof(s->wdt.stage_conf));
    s->wdt.stage[0] = 0x26000000;
    s->wdt.stage[1] = 0x7FFFFFFF;
    s->wdt.stage[2] = 0x0FFFFFFF;
    s->wdt.stage[3] = 0x0FFFFFFF;
    s->wdt.prescaler = 0x100;
    s->wdt.raw_st = 0;
    s->wdt.int_enabled = 0;

    /* Reset Timer0 */
    esp32c3_virtual_counter_reset(&s->t0.counter);
    s->t0.raw_st = 0;
    s->t0.int_enabled = 0;
    s->t0.value_rel = 0;
    /* Set teh divider to 1 */
    s->t0.config = 1 << R_TIMG_T0CONFIG_DIVIDER_SHIFT;
}


static void esp32c3_timg_realize(DeviceState *dev, Error **errp)
{
}


static void esp32c3_timg_init(Object *obj)
{
    ESP32C3TimgState *s = ESP32C3_TIMG(obj);
    SysBusDevice *sbd = SYS_BUS_DEVICE(obj);

    memory_region_init_io(&s->iomem, obj, &esp32c3_timg_ops, s,
                          TYPE_ESP32C3_TIMG, ESP32C3_TIMG_IO_SIZE);
    sysbus_init_mmio(sbd, &s->iomem);

    /* Set default value to calibration register */
    s->rtc.rtc_cali_cfg = 1 << R_TIMG_RTCCALICFG_MAX_SHIFT |
                         1 << R_TIMG_RTCCALICFG_CLK_SEL_SHIFT |
                         1 << R_TIMG_RTCCALICFG_START_CYCLING_SHIFT;

    /* Watchdog initialization */
    s->wdt.wkey = ESP32C3_WDT_DEFAULT_WKEY;
    qdev_init_gpio_out_named(DEVICE(sbd), &s->wdt.reset_irq, ESP32C3_WDT_IRQ_RESET, 1);
    qdev_init_gpio_out_named(DEVICE(sbd), &s->wdt.interrupt_irq, ESP32C3_WDT_IRQ_INTERRUPT, 1);
    timer_init_ns(esp32c3_virtual_counter_get_timer(&s->wdt.counter), QEMU_CLOCK_VIRTUAL, esp32c3_wdt_cb, &s->wdt);
    s->wdt.stage[0] = 0x26000000;
    s->wdt.stage[1] = 0x7FFFFFFF;
    s->wdt.stage[2] = 0x0FFFFFFF;
    s->wdt.stage[3] = 0x0FFFFFFF;
    s->wdt.prescaler = 0x100;


    /* Timer T0 initialization */
    s->t0.config = 1 << R_TIMG_T0CONFIG_DIVIDER_SHIFT;
    qdev_init_gpio_out_named(DEVICE(sbd), &s->t0.interrupt_irq, ESP32C3_T0_IRQ_INTERRUPT, 1);
    timer_init_ns(esp32c3_virtual_counter_get_timer(&s->t0.counter), QEMU_CLOCK_VIRTUAL, esp32c3_t0_cb, &s->t0);
}

static Property esp32c3_timg_properties[] = {
    // DEFINE_PROP_BOOL("wdt_disable", ESP32C3TimgState, wdt_disable, false),
    DEFINE_PROP_END_OF_LIST(),
};

static void esp32c3_timg_class_init(ObjectClass *klass, void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->reset = esp32c3_timg_reset;
    dc->realize = esp32c3_timg_realize;
    device_class_set_props(dc, esp32c3_timg_properties);
}

static const TypeInfo esp32c3_timg_info = {
    .name = TYPE_ESP32C3_TIMG,
    .parent = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(ESP32C3TimgState),
    .instance_init = esp32c3_timg_init,
    .class_init = esp32c3_timg_class_init
};

static void esp32c3_timg_register_types(void)
{
    type_register_static(&esp32c3_timg_info);
}

type_init(esp32c3_timg_register_types)
